{
    "projects": [
        {"header" : "Financial Consultant Website",
        "img" : "content/financial/main.webp",
        "short_discription" : "This project involved creating a modern and responsive website for a financial consultant. The website features real-time cryptocurrency prices via API integration and offers both light and dark themes for a customizable user experience.",
        "full_discription":"<h3>Financial Consultant Website</h3><img src='content/financial/main.webp'><h3>Project Overview:</h3><p>This project involved creating a modern and responsive website for a financial consultant. The website features real-time cryptocurrency prices via API integration and offers both light and dark themes for a customizable user experience.</p><a href='projects/financial/index.html' class='projects_links' target='_blank'>Go to Website</a><br><h3> </h3><h3> </h3><span class='lang_tags'>#HTML</span><span class='lang_tags'>#CSS</span><span class='lang_tags'>#JavaScript</span><span class='lang_tags'>#jQuery</span><h3>Key Responsibilities:</h3><p>Design and UI/UX: Developed a professional and user-friendly design with both light and dark theme options to cater to user preferences and enhance readability.</p><p>Cryptocurrency API Integration: Integrated a cryptocurrency price API</p><p>Responsive Design: Ensured the website is fully responsive, providing an optimal experience on desktops, tablets, and mobile devices.</p><p>Frontend Development: Utilized HTML, CSS, and jQuery to create a dynamic and interactive user interface.</p><img src='content/financial/desctop_full.webp'><p>Integrating a reliable cryptocurrency price API and displaying real-time information in an accessible and visually appealing manner.</p><p>Designing and implementing a dual-theme system (light and dark) that provides a consistent and enjoyable user experience.</p><p>Ensuring seamless and responsive design across all devices, maintaining functionality and aesthetics on desktops, tablets, and mobile phones.</p><p>Leveraging jQuery to enhance interactivity and provide smooth transitions between themes and dynamic content updates.</p><img src='content/financial/mobile.webp'><img src='content/financial/main_dark.webp'>"},

        {"header" : "Surfboard Rental Website",
        "img" : "content/rental/main.webp",
        "short_discription" : "This project involved creating a comprehensive website for a surfboard rental shop and café. The website features an integrated weather API, online surfboard selection, and booking system, providing a seamless experience for users looking to rent surfboards and enjoy the café's offerings.",
        "full_discription":"<h3>Surfboard Rental Website</h3><img src='content/rental/main.webp'><h3>Project Overview:</h3><p>This project involved creating a comprehensive website for a surfboard rental shop and café. The website features an integrated weather API, online surfboard selection, and booking system, providing a seamless experience for users looking to rent surfboards and enjoy the café's offerings.</p><span class='lang_tags'>#HTML</span><span class='lang_tags'>#CSS</span><span class='lang_tags'>#JavaScript</span><span class='lang_tags'>#PHP</span><span class='lang_tags'>#MySQL</span><span class='lang_tags'>#API</span><h3>Key Responsibilities:</h3><p>Design and UI/UX: Developed an engaging and user-friendly design that captures the vibrant, laid-back atmosphere of the surf shop and café.</p> <p>Weather API Integration: Integrated a weather API to provide real-time weather conditions, helping users make informed decisions about their surfing plans.</p> <p>Online Surfboard Selection and Booking: Implemented an interactive system for users to browse available surfboards, select the right one based on various criteria, and book it online.</p> <p>Responsive Design: Ensured the website is fully responsive, providing an optimal experience on desktops, tablets, and mobile devices.</p> <p>Backend Development: Developed a backend using PHP to handle bookings, manage inventory, and process user data securely.</p> <img src='content/rental/desctop_full.webp'><h3>Challenges Overcome:</h3> <p>Integrating a reliable weather API and displaying the information in a user-friendly manner.</p> <p>Designing an intuitive online booking system that allows users to easily find and reserve the perfect surfboard.</p> <p>Ensuring seamless interaction between the frontend and backend, particularly in managing bookings and inventory.</p> <p>Creating a design that reflects the unique vibe of the surf shop and café, attracting both surfers and café-goers.</p> <h3>Project Outcome:</h3> <p>The resulting website provides a dynamic and user-friendly platform for surfboard rentals and café services. With its real-time weather updates, intuitive booking system, and responsive design, the site offers a seamless experience for users on all devices. The backend efficiently manages bookings and inventory, ensuring smooth operations for the business.</p>"},

        {"header" : "Travel Agency Website",
        "img" : "content/travel/main.webp",
        "short_discription" : "This project entailed the complete development of a travel agency website, including the design, animation, responsiveness, and backend integration. The goal was to create an engaging and functional platform for users to explore and book travel packages.",
        "full_discription":"<h3>Travel Agency Website</h3><img src='content/travel/main.webp'><h3>Project Overview:</h3><p>This project entailed the complete development of a travel agency website, including the design, animation, responsiveness, and backend integration. The goal was to create an engaging and functional platform for users to explore and book travel packages.</p><a href='projects/travel/index.html' class='projects_links' target='_blank'>Go to Website</a><br><h3> </h3><h3> </h3><span class='lang_tags'>#HTML</span><span class='lang_tags'>#CSS</span><span class='lang_tags'>#JavaScript</span><span class='lang_tags'>#PHP</span><span class='lang_tags'>#MySQL</span><h3>Key Responsibilities:</h3><p>Design and UI/UX: Developed an attractive and intuitive design that reflects the adventurous spirit of the travel agency, ensuring a user-friendly experience.</p> <p>Interactive Animations: Utilized JavaScript to add dynamic animations that enhance user engagement and make the browsing experience more enjoyable.</p> <p>Responsive Design: Implemented responsive web design techniques to ensure the site performs optimally on a variety of devices, including desktops, tablets, and mobile phones.</p> <p>Database Integration: Created and managed a comprehensive database of travel packages using MySQL, allowing users to search and filter tours based on their preferences.</p><img src='content/travel/desctop_full.webp'><h3></h3> <p>Designing a visually appealing yet highly functional site that caters to the diverse needs of travelers.</p> <p>Implementing complex animations without compromising the site's performance and load times.</p> <p>Ensuring seamless interaction between the frontend and backend</p> <p>Creating a robust and scalable database that can efficiently handle a large volume of travel packages and user queries.</p> <img src='content/travel/tours_page.webp'> <img src='content/travel/product_page.webp'> <h3>Project Outcome:</h3> <p>The finished website offers a captivating and efficient platform for users to explore and book travel packages. With its appealing design, engaging animations, and responsive layout, the site provides a seamless user experience across all devices. The backend and database integration ensure smooth and secure management of travel packages and bookings, effectively meeting the needs of both the travel agency and its customers.</p><img src='content/travel/mobile.webp'><img src='content/travel/mobile_2.webp'>"},

        {"header" : "Photo School",
        "img" : "content/photo/main.webp",
        "short_discription" : "This project entailed the complete development of a photo school website, including the design, animation and responsiveness. The goal was to create an engaging and functional platform for users to book photo lessons.",
        "full_discription":"<h3>Photo School</h3><img src='content/photo/main.webp'><h3>Project Overview:</h3><p>This project entailed the complete development of a photo school website, including the design, animation and responsiveness. The goal was to create an engaging and functional platform for users to book photo lessons</p><span class='lang_tags'>#HTML</span><span class='lang_tags'>#CSS</span><span class='lang_tags'>#JavaScript</span><h3>  </h3><img src='content/photo/1.webp'><h3>  </h3><img src='content/photo/2.webp'>"},

        {"header" : "Psychologist's Website",
        "img" : "content/psy/main.webp",
        "short_discription" : "This project involved developing a comprehensive website for a psychologist, designed to provide information about services, facilitate appointment bookings, and offer valuable resources. The goal was to create a user-friendly platform that builds trust and encourages potential clients to book sessions.",
        "full_discription":"<h3>Psychologist's Website</h3><img src='content/psy/main.webp'><h3>Project Overview:</h3><p>This project involved developing a comprehensive website for a psychologist, designed to provide information about services, facilitate appointment bookings, and offer valuable resources. The goal was to create a user-friendly platform that builds trust and encourages potential clients to book sessions.</p><a href='projects/psy/index.html' class='projects_links' target='_blank'>Go to Website</a><br><h3> </h3><h3> </h3><span class='lang_tags'>#HTML</span><span class='lang_tags'>#CSS</span><span class='lang_tags'>#JavaScript</span><h3>Key Responsibilities:</h3><p>Design and Layout: Created a calming and professional design that reflects the psychologist's practice and makes visitors feel at ease. Contact Information: Integrated clear and accessible contact information, including phone numbers, email addresses, and a contact form for easy communication. Informative Content: Developed and organized content to provide visitors with valuable information about psychological services, therapy approaches, and mental health tips.</p><img src='content/psy/desctop_full.webp'><h3>Responsive Design:</h3> <p>Built the website to be fully responsive, providing an optimal browsing experience on a wide range of devices, from desktops to mobile phones.</p><p>The resulting website provides a professional and welcoming online presence for the psychologist. It includes a fully functional appointment booking system, clear contact information, and valuable content on mental health. The site is designed to be user-friendly, accessible, and optimized for search engines, ensuring it reaches and serves the intended audience effectively.</p><img src='content/psy/mobile.webp'>"},

        {"header" : "Restaurant Website",
        "img" : "content/rest/main.webp",
        "short_discription" : "This project involved creating a complete website for a restaurant, encompassing design, responsive adaptation, and interactive animations using JavaScript. The aim was to develop an engaging and user-friendly online presence for the restaurant.",
        "full_discription":"<h3>Restaurant Website</h3><img src='content/rest/main.webp'><h3>Project Overview:</h3><p>This project involved creating a complete website for a restaurant, encompassing design, responsive adaptation, and interactive animations using JavaScript. The aim was to develop an engaging and user-friendly online presence for the restaurant.</p><span class='lang_tags'>#HTML</span><span class='lang_tags'>#CSS</span><span class='lang_tags'>#JavaScript</span><h3>Key Responsibilities:</h3><p>Developed a visually appealing design tailored to the restaurant's brand identity, ensuring an inviting and appetizing user experience.</p><p>Implemented dynamic animations and interactive elements using JavaScript to enhance user engagement and improve the overall aesthetic of the site.</p> <p>Structured the content logically and intuitively, making it easy for visitors to find information about the menu, location, and reservations.</p><img src='content/rest/desctop_full.webp'><h3>Responsive Design:</h3> <p>Built the website to be fully responsive, providing an optimal browsing experience on a wide range of devices, from desktops to mobile phones.</p><img src='content/rest/mobile.webp'>"},

        {"header" : "Figma to HTML/CSS Conversion",
        "img" : "content/event/main.webp",
        "short_discription" : "This project involved converting a detailed design from Figma into a fully responsive and functional HTML/CSS webpage. The goal was to create a pixel-perfect representation of the Figma design while ensuring compatibility across various devices and browsers.",
        "full_discription":"<h3>Figma to HTML/CSS Conversion</h3><img src='content/event/main.webp'><h3>Project Overview:</h3><p>This project involved converting a detailed design from Figma into a fully responsive and functional HTML/CSS webpage. The goal was to create a pixel-perfect representation of the Figma design while ensuring compatibility across various devices and browsers.</p><span class='lang_tags'>#HTML</span><span class='lang_tags'>#CSS</span><span class='lang_tags'>#Figma</span><h3>Key Responsibilities:</h3><p>Design Translation: Accurately translated the Figma design into HTML and CSS, maintaining fidelity to the original layout, typography, and color scheme.</p><img src='content/event/desctop_full.webp'><h3>Responsive Design:</h3> <p>Utilized Design: Utilized media queries and flexible grid layouts to ensure the webpage is fully responsive, providing an optimal viewing experience on desktops, tablets, and mobile devices. Cross-Browser Compatibility: Ensured that the webpage functions seamlessly across different browsers, including Chrome, Firefox, Safari, and Edge.</p><img src='content/event/mobile.webp'>"},


        {"header" : "Figma to HTML/CSS Conversion",
        "img" : "content/agency/main.webp",
        "short_discription" : "This project involved converting a detailed design from Figma into a fully responsive and functional HTML/CSS webpage. The goal was to create a pixel-perfect representation of the Figma design while ensuring compatibility across various devices and browsers.",
        "full_discription":"<h3>Figma to HTML/CSS Conversion</h3><img src='content/agency/main.webp'><h3>Project Overview:</h3><p>This project involved converting a detailed design from Figma into a fully responsive and functional HTML/CSS webpage. The goal was to create a pixel-perfect representation of the Figma design while ensuring compatibility across various devices and browsers.</p><span class='lang_tags'>#HTML</span><span class='lang_tags'>#CSS</span><span class='lang_tags'>#Figma</span><h3>Key Responsibilities:</h3><p>Design Translation: Accurately translated the Figma design into HTML and CSS, maintaining fidelity to the original layout, typography, and color scheme.</p><img src='content/agency/desctop_full.webp'><h3>Responsive Design:</h3> <p>Utilized media queries and flexible grid layouts to ensure the webpage is fully responsive, providing an optimal viewing experience on desktops, tablets, and mobile devices. Cross-Browser Compatibility: Ensured that the webpage functions seamlessly across different browsers, including Chrome, Firefox, Safari, and Edge.</p><img src='content/agency/mobile.webp'>"}
    ]
}